texts_dict = {
    'intro': {
        'title': 'ريتات السعودية',
        'body': 'هذا الموقع هو مشروع نبع من احتياج شخصي. جمعت فيه ما أظن أنه المقاييس المالية المهمة لتقييم لصناديق الاستثمار العقاري المتداولة في السعودية. تقوم فكرة الموقع بشكل رئيسي على تقييم الصناديق بالنظر إلى الأموال من العمليات التشغيلية Funds From Operation (FFO) (أو أموال العمليات التشغيلية) بدلاً من النظر للإيرادات Eranings أو صافي الدخل Net Income وهو مقياس تم استحداثه بواسطة الرابطة (الأمريكية) الوطنية لصناديق الاستثمار العقاري (NAREIT). بالرغم من كونه مقياس غير معياري في مبادئ المحاسبة إلا أنه يوجد إتفاق عام بين الماليين أنه المقياس الأكثر دقة في وصف نشاطات الصندوق، وتقوم كثير من الصناديق حول العالم بإعلانه في القوائم المالية اختيارياً. في السعودية، يوجد 3 صناديق تقوم بإعلانه في القوائم المالية هم: الرياض ريت، الأهلي ريت، والراجحي ريت. على أي حال، هو رقم يمكن بسهولة حسابه بالنظر للقوائم المالية للصندوق. لماذا الأموال من العمليات التشغيلية بدلاً من الإيرادات وصافي الدخل؟ السبب الرئيسي: الاهلاك أو الهبوط في قيمة الأصول الثابتة.',
    },
    'pffo': {
        'title': 'مكرر النقد من العمليات P/FFO',
        'body': 'أفضل طريقة للتعامل مع النصوص العربية بلغة بيثون هو استخدام الترميز يونيكود، التي يدعمها بيثون دعما أصليا، لا حاجة فيه إلى مكتبات خارجية أو دوال خاصة، وقد يكون هذا أهمّ ما دفعني لاختيار لغة بيثون، إذ يكفي أن تسبق النص بحرف يو u لتدع بيثون يريحك من عناء التفكير وبرمجة النصوص، ويعامل معها بشفافية عالية.',
    },
    'yield': {
        'title': 'عائد التوزيعات النقدية Dividend Yield',
        'body': 'أفضل طريقة للتعامل مع النصوص العربية بلغة بيثون هو استخدام الترميز يونيكود، التي يدعمها بيثون دعما أصليا، لا حاجة فيه إلى مكتبات خارجية أو دوال خاصة، وقد يكون هذا أهمّ ما دفعني لاختيار لغة بيثون، إذ يكفي أن تسبق النص بحرف يو u لتدع بيثون يريحك من عناء التفكير وبرمجة النصوص، ويعامل معها بشفافية عالية.',
    },
    'ffos': {
        'title': 'ربحية السهم من الأموال من العمليات FFO/Share',
        'body': 'عند تقييم الصناديق العقارية، تعتبر ربحية السهم من الأموال من العمليات البديل للمقياس المالي ربحية السهم Earnings Per Sahre (EPS) المعمول به عن تقييم الشركات. الصناديق العقارية الناجحة تزيد باستمرار من ربحية السهم من الأموال من العمليات مما يعطيها فرصة للتوسع وبالتالي دعم التوزيعات النقدية وارتفاع سعر السهم.',
    },
    'ffo_payout': {
        'title': 'نسبة التوزيعات النقدية إلى الأموال من العمليات FFO Payout Raito',
        'body': 'مقدار التوزيعات النقدية بالنسبة إلى الأموال من العمليات بدلاً من احتسابها بالنسبة إلى صافي الدخل كما هو معمول به في الشركات. بالنسبة للصناديق العقارية فإن الرقم المفضل هو أقل من 90%. زيادة النسبة بشكل مستمر تشير إلى أن التوزيعات تنمو بوتيرة أسرع من نمو الأموال من العمليات للصندوق.',
    },
}


def display_text(x, title_size=16, asis=False):
    
    global texts_dict
    
    if asis == True:
        text = texts_dict[x]
    
    else:
        text = '''
        <p style="direction: rtl; text-align: justify; font-size:{ts}px; font-weight: bold;">{title}</p>
        <p style="direction: rtl; text-align:justify">{body}</p>
        '''.format(
            ts = title_size,
            title = texts_dict[x]['title'],
            body = texts_dict[x]['body'])
    
    return text
