texts_dict = {
    'empty': {
        'title': '',
        'body': '',
    },
    'pffo': {
        'title': 'مكرر النقد من العمليات P/FFO',
        'body': 'أفضل طريقة للتعامل مع النصوص العربية بلغة بيثون هو استخدام الترميز يونيكود، التي يدعمها بيثون دعما أصليا، لا حاجة فيه إلى مكتبات خارجية أو دوال خاصة، وقد يكون هذا أهمّ ما دفعني لاختيار لغة بيثون، إذ يكفي أن تسبق النص بحرف يو u لتدع بيثون يريحك من عناء التفكير وبرمجة النصوص، ويعامل معها بشفافية عالية.',
    },
    'yield': {
        'title': 'عائد التوزيعات النقدية Dividend Yield',
        'body': 'أفضل طريقة للتعامل مع النصوص العربية بلغة بيثون هو استخدام الترميز يونيكود، التي يدعمها بيثون دعما أصليا، لا حاجة فيه إلى مكتبات خارجية أو دوال خاصة، وقد يكون هذا أهمّ ما دفعني لاختيار لغة بيثون، إذ يكفي أن تسبق النص بحرف يو u لتدع بيثون يريحك من عناء التفكير وبرمجة النصوص، ويعامل معها بشفافية عالية.',
    },
    'ffos': {
        'title': 'ربحية السهم من الأموال من العمليات FFO/Share',
        'body': 'عند تقييم الصناديق العقارية، تعتبر ربحية السهم من الأموال من العمليات البديل للمقياس المالي ربحية السهم Earnings Per Sahre (EPS) المعمول به عن تقييم الشركات. الصناديق العقارية الناجحة تزيد باستمرار من ربحية السهم من الأموال من العمليات مما يعطيها فرصة للتوسع وبالتالي دعم التوزيعات النقدية وارتفاع سعر السهم.',
    },
    'ffo_payout': {
        'title':'',
        'body': '',
    },
}
